; Translation file for AltDrag 1.0
; sk-SK localization by Miroslav Miklus
; Simply put this file in the same directory as AltDrag, then reload AltDrag.
; Please read the website for help: https://stefansundin.github.io/altdrag/doc/translate.html
; Use encoding UTF-16LE with BOM to be able to use Unicode

[Translation]
Code=sk-SK
LangEnglish=Slovak
Lang=Slovenčina
Author=Miroslav Miklus

TrayEnabled=AltDrag
TrayDisabled=AltDrag (vypnutý)
MenuEnable=Zapnúť
MenuDisable=Vypnúť
MenuHideTray=Odstrániť z lišty
MenuUpdateAvailable=Aktualizácia dostupná!
MenuConfigure=Otvoriť nastavenia
MenuAbout=O aplikácii
MenuExit=Koniec

UpdateBalloon=Dostupná nová verzia!
UpdateDialog=Je dostupná nová verzia. Prejsť na webstránku?
UpdateLatest=Nie sú dostupné žiadne aktualizácie.

ConfigTitle=AltDrag Konfigurácia
ConfigTabGeneral=Všeobecné
ConfigTabInput=Myš a klávesnica
ConfigTabBlacklist=Blacklist
ConfigTabAdvanced=Pokročilé
ConfigTabAbout=O aplikácii

GeneralBox=Všeobecné nastavenia
GeneralAutoFocus=&Označiť okno počas premiesňovania.\nOkno je možné označiť stlačením klávesy Ctrl.
GeneralAero=Mimic Aero S&nap
GeneralInactiveScroll=&Skrolovanie neaktívnych okien
GeneralMDI=&MDI support
GeneralAutoSnap=Automatické uchytenie na:
GeneralAutoSnap0=Vypnuté
GeneralAutoSnap1=Na okraje obrazovky
GeneralAutoSnap2=+ mimo okien
GeneralAutoSnap3=+ vnútri okien
GeneralLanguage=Jazyk:
GeneralAutostartBox=Autoštart
GeneralAutostart=Š&tart AltDrag po prihlásení
GeneralAutostartHide=&Schovať lištu
GeneralAutostartElevate=&Elevate to administrator privileges
GeneralAutostartElevateTip=Note that a UAC prompt will appear every time you log in, unless you disable UAC completely.
GeneralElevate=E&levate
GeneralElevated=Elevated
GeneralElevateTip=This will create a new instance of AltDrag which is running with administrator privileges. This allows AltDrag to manage other programs which are running with administrator privileges.\n\nYou will have to approve a UAC prompt from Windows to allow AltDrag to run with administrator privileges.
GeneralElevationAborted=Elevation aborted.
GeneralAutosave=Upozornenie: Nastavenia sú ukladané a aplikované okamžite!

InputMouseBox=Akcie myši
InputMouseLMB=Ľavé tlačidlo myši:
InputMouseMMB=Stredné tlačidlo myši:
InputMouseRMB=Pravé tlačidlo myši:
InputMouseMB4=4. tlačidlo myši:
InputMouseMB5=5. tlačidlo myši:
InputMouseScroll=Scroll:
InputMouseLowerWithMMB=&Lower windows by middle clicking on title bars

InputActionMove=Move
InputActionResize=Resize
InputActionClose=Close
InputActionMinimize=Minimize
InputActionLower=Lower
InputActionAlwaysOnTop=AlwaysOnTop
InputActionBorderless=Toggle borderless
InputActionCenter=Center
InputActionNothing=Nothing
InputActionAltTab=Alt+Tab
InputActionVolume=Volume
InputActionTransparency=Transparency

InputHotkeysBox=Klávesové skratky
InputHotkeysLeftAlt=&Left Alt
InputHotkeysRightAlt=&Right Alt
InputHotkeysLeftWinkey=Left &Winkey
InputHotkeysRightWinkey=Right W&inkey
InputHotkeysLeftCtrl=Left &Ctrl
InputHotkeysRightCtrl=Right C&trl
InputHotkeysMore=Ďalšie klávesové skratky môžete zadefinovať v .ini súbore! Prilepenie okien docielite podržaním klávesy Shift.

BlacklistBox=Nastavenie blacklistu
BlacklistProcessBlacklist=Blacklist procesov:
BlacklistBlacklist=Blacklist:
BlacklistSnaplist=Snaplist:
BlacklistExplanation=Princíp fungovania blacklistu je možné nájsť na <a href="https://stefansundin.github.io/altdrag/doc/blacklist.html">wiki</a>
BlacklistFindWindowBox=Identifikácia okna
BlacklistFindWindowExplanation=Túto funkciu je možné využiť pre určenie "classname" okna, použiteľného pre funkcionality blacklistu, či prichytávania okien v rámci snaplistu.

AdvancedBox=Pokročilé nastavenia
AdvancedHookWindows=&Povoliť prichytávanie počas presunu okien.\nPracuje pri zapnutom automatickom prichytávaní okien!
AdvancedHookWindowsWarn=Táto funkcia nie je 100% bezpečná, nakoľko je potrebný zásah do iných procesov.
AdvancedUpdateCheckOnStartup=Automatická kontrola akt&ualizácii
AdvancedUpdateBeta=Kontrolovať aj dostupnosť &beta verzii
AdvancedUpdateCheckNow=Skontrolovať aktualizácie
AdvancedIni=AltDrag nastavenia sú ukladané do súboru AltDrag.ini. Niektoré nastavenia je možné upraviť len manuálnou editáciou tohto súboru.
AdvancedOpenIni=Otvoriť &ini súbor

AboutBox=O aplikácií AltDrag
AboutVersion=Verzia
AboutAuthor=Autor Stefan Sundin
AboutLicense=AltDrag je voľne dostupný softvér s otvoreným zdrojovým kódom. Šírte ho prosím ďalej.
AboutDonate=&Prispej
AboutTranslationCredit=Translation credit

MiscUnhookError=There was an error disabling AltDrag. This was most likely caused by Windows having already disabled AltDrag's hooks.\n\nIf this is the first time this has happened, you can safely ignore it and continue using AltDrag.\n\nIf this is happening repeatedly, you can read on the website wiki how to prevent this from happening again (look for 'AltDrag mysteriously stops working' on the About page).
